In [1]:
import pandas as pd

data = {
    "Student": ["Ayesha", "Bilal", "Chin", "Deepa"],
    "Age": [22, 24, 23, 21],
    "Score": [88, 75, 90, 85],
    "Passed": [True, False, True, True]
}
df = pd.DataFrame(data)
print(df)

  Student  Age  Score  Passed
0  Ayesha   22     88    True
1   Bilal   24     75   False
2    Chin   23     90    True
3   Deepa   21     85    True

In [2]:
df.loc[len(df)] = ["Eshan", 25, 78, False]
print(df)

  Student  Age  Score  Passed
0  Ayesha   22     88    True
1   Bilal   24     75   False
2    Chin   23     90    True
3   Deepa   21     85    True
4   Eshan   25     78   False

In [3]:
df["Score boosted"] = df["Score"] + 10

In [4]:
print(df)

  Student  Age  Score  Passed  Score boosted
0  Ayesha   22     88    True             98
1   Bilal   24     75   False             85
2    Chin   23     90    True            100
3   Deepa   21     85    True             95
4   Eshan   25     78   False             88

In [5]:
#drop column
df.drop(["Score boosted"], axis = 1) #returns a new df
df.drop(["Score boosted"], axis = 1, inplace = True) #modifies the existing datframe
print(df)

  Student  Age  Score  Passed
0  Ayesha   22     88    True
1   Bilal   24     75   False
2    Chin   23     90    True
3   Deepa   21     85    True
4   Eshan   25     78   False

In [6]:
# remove multiple columns
df.drop(["Age","Score"], axis = 1)

  Student  Passed
0  Ayesha    True
1   Bilal   False
2    Chin    True
3   Deepa    True
4   Eshan   False

In [7]:
#remove row
df.drop([0])

  Student  Age  Score  Passed
1   Bilal   24     75   False
2    Chin   23     90    True
3   Deepa   21     85    True
4   Eshan   25     78   False

In [8]:
df.drop([2,4])

  Student  Age  Score  Passed
0  Ayesha   22     88    True
1   Bilal   24     75   False
3   Deepa   21     85    True

In [13]:
df.drop(df.index[ df["Student"] == "Chin"])

  Student  Age  Score  Passed
0  Ayesha   22     88    True
1   Bilal   24     75   False
3   Deepa   21     85    True
4   Eshan   25     78   False

In [14]:
##Challenge

In [34]:
import pandas as pd


data = {
    "Name": ["Ayesha", "Bilal", "Chin", "Deepa"],
    "Score" : [88, 76, 92, 67],
    "Age" : [22, 24, 23, 21]
}

#creating the dataframe
df = pd.DataFrame(data)

# create a passed column such that it's true for score greater or equal to 80
df["Passed"] = df["Score"] >= 80

# add a new row
df.loc[len(df)] = ["Eshan", 85, 25, True]

# remove student named Bilal
df.drop(df.index[df["Name"] == "Bilal"], inplace = True)

# function that awards
def Awards(score):
    if score >= 90:
        return "Gold"
    elif score >= 80:
        return "Silver"
    else:
        return "None"

df["Award"] = df["Score"].apply(Awards)

df.sort_values("Score", ascending = False, inplace = True)

df.reset_index(drop=True, inplace = True)

print(df)

     Name  Score  Age  Passed   Award
0    Chin     92   23    True    Gold
1  Ayesha     88   22    True  Silver
2   Eshan     85   25    True  Silver
3   Deepa     67   21   False    None